; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	satellite4 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	thermograph0 - mode
	image2 - mode
	thermograph1 - mode
	Star6 - direction
	Star0 - direction
	GroundStation5 - direction
	Star4 - direction
	Star7 - direction
	Star3 - direction
	Star8 - direction
	Star1 - direction
	Star2 - direction
	Planet9 - direction
	Planet10 - direction
	Star11 - direction
	Planet12 - direction
	Planet13 - direction
	Star14 - direction
	Star15 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star3)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation5)
	(supports instrument1 image2)
	(supports instrument1 thermograph0)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 Star6)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet12)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 Star3)
	(calibration_target instrument2 Star8)
	(calibration_target instrument2 Star7)
	(supports instrument3 thermograph0)
	(supports instrument3 image2)
	(calibration_target instrument3 Star7)
	(calibration_target instrument3 GroundStation5)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star14)
	(supports instrument4 thermograph1)
	(supports instrument4 thermograph0)
	(supports instrument4 image2)
	(calibration_target instrument4 Star7)
	(calibration_target instrument4 Star3)
	(calibration_target instrument4 Star4)
	(on_board instrument4 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star1)
	(supports instrument5 image2)
	(supports instrument5 thermograph0)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 Star1)
	(calibration_target instrument5 Star3)
	(supports instrument6 thermograph1)
	(calibration_target instrument6 Star8)
	(calibration_target instrument6 Star1)
	(supports instrument7 image2)
	(calibration_target instrument7 Star2)
	(calibration_target instrument7 Star1)
	(on_board instrument5 satellite4)
	(on_board instrument6 satellite4)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet10)
)
(:goal (and
	(pointing satellite3 Star11)
	(have_image Planet9 thermograph1)
	(have_image Planet10 image2)
	(have_image Star11 image2)
	(have_image Planet12 thermograph0)
	(have_image Planet13 thermograph1)
	(have_image Star14 thermograph1)
	(have_image Star15 image2)
))

)

; plan
1. (turn_to satellite3 star3 star1)
   deleted: (pointing satellite3 star1)
   added: (pointing satellite3 star3)
   goals met: 0 of 8
2. (switch_on instrument4 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument4)
   goals met: 0 of 8
3. (calibrate satellite3 instrument4 star3)
   added: (calibrated instrument4)
   goals met: 0 of 8
4. (turn_to satellite3 planet9 star3)
   deleted: (pointing satellite3 star3)
   added: (pointing satellite3 planet9)
   goals met: 0 of 8
5. (take_image satellite3 planet9 instrument4 thermograph1)
   added: (have_image planet9 thermograph1)
   goals met: 1 of 8
6. (turn_to satellite3 planet13 planet9)
   deleted: (pointing satellite3 planet9)
   added: (pointing satellite3 planet13)
   goals met: 1 of 8
7. (take_image satellite3 planet13 instrument4 thermograph1)
   added: (have_image planet13 thermograph1)
   goals met: 2 of 8
8. (turn_to satellite3 planet12 planet13)
   deleted: (pointing satellite3 planet13)
   added: (pointing satellite3 planet12)
   goals met: 2 of 8
9. (take_image satellite3 planet12 instrument4 thermograph0)
   added: (have_image planet12 thermograph0)
   goals met: 3 of 8
10. (turn_to satellite3 planet10 planet12)
   deleted: (pointing satellite3 planet12)
   added: (pointing satellite3 planet10)
   goals met: 3 of 8
11. (take_image satellite3 planet10 instrument4 image2)
   added: (have_image planet10 image2)
   goals met: 4 of 8
12. (turn_to satellite3 star14 planet10)
   deleted: (pointing satellite3 planet10)
   added: (pointing satellite3 star14)
   goals met: 4 of 8
13. (take_image satellite3 star14 instrument4 thermograph1)
   added: (have_image star14 thermograph1)
   goals met: 5 of 8
14. (turn_to satellite3 star15 star14)
   deleted: (pointing satellite3 star14)
   added: (pointing satellite3 star15)
   goals met: 5 of 8
15. (take_image satellite3 star15 instrument4 image2)
   added: (have_image star15 image2)
   goals met: 6 of 8
16. (turn_to satellite3 star11 star15)
   deleted: (pointing satellite3 star15)
   added: (pointing satellite3 star11)
   goals met: 7 of 8
17. (take_image satellite3 star11 instrument4 image2)
   added: (have_image star11 image2)
   goals met: 8 of 8
